// src/Assets/infoBlocks.js
import img2 from '../Assets/product2.jpg';
import img3 from '../Assets/product3.jpg';
import img4 from '../Assets/product4.jpg';

const infoBlocks = [
  {
    id: 1,
    img: img2,
    title: 'ИДЕЯ БРЕНДА',
    text: `Идея KODOBUK возникла, когда российский рынок лишился многих привычных брендов.
Мы захотели создать не просто отечественную обувь, а современный продукт с NFC-технологией, который бы объединял комфорт, стиль и цифровой опыт.
KODOBUK — это шаг к инновациям и новый взгляд на кроссовки и кеды в России.`,
    reverse: false,
  },
  {
    id: 2,
    img: img3,
    title: 'ЧТО ОЗНАЧАЕТ KODOBUK?',
    text: `KODOBUK — это обувь с NFC-меткой, где цифровые технологии становятся частью русской идентичности.
Каждая пара — это не только комфорт и стиль, но и доступ к историям, традициям и эксклюзивному контенту бренда.

KODOBUK — твоя связь с землёй, культурой и будущим.`,
    reverse: true,
  },
  {
    id: 3,
    img: img4,
    title: 'ЧТО НАС ВДОХНОВЛЯЕТ?',
    text: `Мы черпаем вдохновение в наследии русской культуры, в атмосфере вечной классики и современного города.
Нам близки кинематограф, музыка, искусство, детали старых улиц и энергия свободных людей.
Создавая обувь KODOBUK, мы соединяем эстетику прошлого с технологиями будущего — чтобы каждый шаг был уверенным, а стиль оставался вне времени.`,
    reverse: false,
  },
];

export default infoBlocks;
